cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

cask 'xquartz' # required for libcaca
cask 'java'    # required for gradle

brew 'bash-completion'
brew 'bat'
brew 'coreutils'
brew 'dfu-programmer'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'gradle'
brew 'httpie'
brew 'hub'
brew 'jp2a'
brew 'jenv'
brew 'jq'
brew 'kotlin'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'maven'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace' # fixes pbcopy and pbpaste in tmux
brew 'roundup'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'spark'
brew 'tmux'
brew 'tokei'
brew 'unrar'
brew 'weechat'
brew 'wget'
brew 'yarn'
brew 'zsh'

cask 'bartender'
cask 'bettertouchtool'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'hammerspoon'
cask 'hyperswitch'
cask 'istat-menus' # might need sudo spctl --master-disable
cask 'iterm2'
cask 'karabiner-elements'
cask 'jetbrains-toolbox'
cask 'postbox'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'tunnelblick'
cask 'visual-studio-code'
