cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
# QMK dev
tap 'osx-cross/avr'
tap 'PX4/homebrew-px4'
# QMK dev

cask 'xquartz' # required for libcaca

brew 'asdf'
brew 'bash-completion'
brew 'bat'
brew 'coreutils'
brew 'dfu-programmer'
brew 'exa'
brew 'fd'
brew 'fish'
brew 'fzf'
brew 'git'
brew 'httpie'
brew 'jp2a'
brew 'libgit2'
brew 'mas'
brew 'openssl'
brew 'puma/puma/puma-dev'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace' # fixes pbcopy and pbpaste in tmux
brew 'ripgrep'
brew 'roundup'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'spark'
brew 'starship'
brew 'tmux'
brew 'tokei'
brew 'unrar'
brew 'weechat'
brew 'wget'
brew 'yarn'

# For QMK dev
brew 'avr-gcc@7', link: true
brew 'dfu-programmer'
brew 'dfu-util'
brew 'gcc-arm-none-eabi'
brew 'avrdude'
# End QMK dev


cask 'bartender'
cask 'bettertouchtool'
cask 'dropbox'
cask 'daisydisk'
cask 'fantastical'
cask 'firefox'
cask 'flux'
cask 'github'
cask 'gitify'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hammerspoon'
cask 'hyperswitch'
cask 'istat-menus' # might need sudo spctl --master-disable
cask 'iterm2'
cask 'karabiner-elements'
cask 'keycastr'
cask 'jetbrains-toolbox'
cask 'postbox'
cask 'qmk-toolbox'
cask 'rambox'
cask 'slack' # might not need this with rambox
cask 'sonos'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'sublime-merge'
cask 'ultimaker-cura'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'zulip' # might not need this with rambox

mas "GIF Brewery 3 by Gfycat (3.9.2)", id: 1081413713 
mas "The Unarchiver", id: 425424353
mas "LastPass Password Manager", id: 926036361
# mas "Microsoft OneNote", id: 784801555
# mas "OneHighlighter", id: 1131580917
mas "GIF Keyboard (2.0.5)", id: 1043270657
mas "1Password 7 - Password Manager", id: 1333542190
